{
  "brand_brief": "TRANSCRIPT ANALYSIS REQUEST: Please analyze this SUBFRACTURE brand development conversation for strategic insights and breakthrough opportunities. This is a raw, unfiltered brand strategy session transcript discussing our new design studio/brand intelligence agency. The conversation covers our brand purpose (creative destructionism), personality (human, cool, rock star), positioning (for brand operators), USP (starting with the end in mind), cultural positioning (emerging brands vs traditional), and core philosophy (keeping humans in the tech loop). Key themes include: creative strategy + design + technology integration, brand worlds creation, high-touch AI experiences, anti-slop positioning, heart-led technology, and the metaphor of surfing the AI wave. Extract strategic insights about brand positioning, market opportunities, competitive advantages, and actionable recommendations for launching this innovative brand intelligence agency.\n\nFull Transcript:\n\nOkay, so I'll just go through this and I'll ask the questions and we'll have a conversation around it. Okay, you know what I mean? And so there's some obvious stuff as well. So like the first thing obviously brand name so sub-fracture is the brand name. Oh is that oh yeah we're talking about our brand we're not talking specifically about the AI thing. It's kind of point in time. So the first sort of thing is like you know describe your brand you know detail your campaign and business goals. So what are we? Well design studio is a time for you to laugh. Yeah. For lack of a better term like a poor thinking flash innovative design studio. Yeah so our brand is a design studio and design a detailed campaign and business goals. My answer would be brand intelligent agency building brand ecosystems. Yeah brand intelligence agency. Yeah. We don't like the word agency is anything. We like the word studio because it's trendy. Yeah. So it already starts talking about campaigns here. Well it's sort of like well you know what's your brand what are you trying to achieve? Yeah. So you know campaign business goals we want to like launch a new agency and attract clients. You know what I mean? Yeah. Launch a new agency model and attract clients. Okay so you know let's just start in point right what my brand's purpose is what is our purpose see this is where it gets to the interest of like we want it. Well it's born out of like like an identified need or desire really. Yeah. I think the biggest thing is just seeing that there is a new wave of I don't know just kind of working existing so wanting to be a part of that I guess and knowing that work the way that we're kind of collaborating we're going to have something to offer that I don't think other people will or want to do in the same way. Yeah okay so new offers right like new brands that do new offers are like you know they the purposes you know to disrupt the status quo. Yeah right to create progress to move sort of through and stuff like that. Do things differently. Do things differently and those kind of things so the purpose is about like you know destroying what came before in order to create kind of new things creative destructionism is kind of like a theory that I like talk about like is on order the credit you think you're going to destroy the kind of old thing is that yeah cool. You know what we're doing like yeah. I'm just I've actually written this out I can't remember what I've written before so it's like disruption. Yeah okay we'll come back to that. Yeah what's our personality. Yeah I don't know. At this point in time I feel like it's kind of like it's grounded in like earthiness like there's like there's like a human element to it. It feels kind of like dark at the moment but then was like dark yeah I don't know like all of branding that we've kind of like put forward so far it's always got like this dark tingling. I'm not saying that that's what it should be. Yeah but as a personality yeah see I if when I look at personality I kind of think like like what's our frame what's how we kind of like when we're when we're engaging with the marketplace when we're engaging with a client like what kind of our kind of frame is well like we've kind of figured out that this is where it's going and we're first-movers and we're leveraging new technology so yeah you may get it you get on board or you're not really the people that we're interested in working with. Yes people are working with together. So the personality word the words that you used to describe person's personality are like things like interest. Well are we smart or are we cool? Do you know what I mean and I can't I'm not sure what the answer to that question is and I and I don't miss I go I've leaned towards where cool. I'd say cool. A cool because I'm smart. Yeah well I feel like being smart is like yeah it's it's just you know open AI and those guys are smart we're not trying to be that smart we're trying to be cool human and cool and stuff like that so you know like how would how would we describe ourselves as a person so think of sub fracture you know it just says a person and the brand that we want they did and like the whole point of this conversation is to show how messy it is like that you know that we might come back to that kind of labor as well. I feel like like like as a person to me kind of has like that rock star element to it. Yeah it brings in the concept of cool as well. Yeah. Like I think and I think defining the cool and smart I think it's is a good way to do it because like rock stars and care about being smart. I just want to be seen as the people are like we kind of want to want to be like that we don't really know why but we kind of want to be like them. Yeah okay let's just keep keep going. There's kind of so I like that there's the so there's this guy that got expelled from Columbia for he created this AI to basically be so like the big tech companies use this interview process called leak code where you get these like like challenging computer science problems and how well you did on those determined how you could like whether or not you'd get an offer to get me to Google or Facebook or one of those companies. Yeah and then this like 21 year of kid Columbia built this system that basically cracked the leak code thing and so it could solve any problem that leak could provide it and basically flipped like flipped the whole tech hiring process on its head but in doing so we also like he like compromised the academic integrity of the union. Yeah yeah yeah so Columbia made this big thing about it but then it was like I fuck you I don't need you raised a couple of million dollars got like brought in by and a 16z address in whole it's and yeah so like now he's got he's sitting like a 300 million dollar valuation and hasn't finished its computer science year even doesn't need so he's kind of like yeah yeah so they're looking they're kind of looking at this AI thing and they're calling themselves like cheating on everything so like that I was just cheating yeah yeah yeah I was thinking about that guy and they could have changed the name from cheating to something else and they're doing high school exams and shit they're doing still and everything he's had to cheat on anything yeah yeah so they they're kind of like and it's funny because everyone looks at that like cheating but it's also like well is it cheating if the system is inherently invalid like if you can't if you can't assess anything because there's now the capability to like break your assessment protocols then like yes is it cheating or does do we need to complete reframe of how we all might be in the street you know coming into this with what we're doing now I'm like I just want to drop the how do we protect our information because I just think that that is it's just gone yeah it's a fucking screen door anyone can access your information stop trying to protect it like you know have like proprietary systems that store data and stuff away from the world but if you only use AI and tools of modernity you're accepting that your information that you're sharing is being shared with the entire world yeah and it's like that that's just the way to approach it for now on so it's like and then because everyone's like so protective of their ideas like oh it's my idea and it's like well ideas are worthless and execution has value but ideas are totally have absolutely no value until you're like welcome in execution so Sam often gave a speech to like combination recently about that he was like stop trying to like protect your IP everyone is too busy building the wrong thing they're like yeah the true value is in like can you can you build it can you deliver it yeah it's like the I mean I was like that when I worked in music I've changed a couple of times but like the sampling thing was starting when around when I was working in music and I was like it really pissed me off at first because I was like if you look at visual artists they pay homage to other visual artists all the time and they'll take the symbols that exist in other pieces of artwork and they'll put it in their artwork as an homage right there's no copyright infringement on using someone else's piece and that's how I felt about sampling because I'm like these sampling laws have been designed to protect Elvis and the Beatles and fucking nobody else you know what I mean because nobody else is really in that kind of sampling law and then if you sample some motel music you know what I mean that no one's ever heard of no one's coming off to you but if you sample the Beatles like you're going to get a season-disgist is not many that's a distraction so okay what we got in personalities human cool and rock star so this is a positioning statement the four only because so my brand is for these people who's our brand for what's for other brands depends on how you want to go right because it's all you're going to go down the brand pathway or is it any brand that we want to work with yeah well I landed on some phrasing when I did this which actually really like which is a brand operator right and so if you're a founder you're operating a brand yeah if you're marketing executives on a team of 20 at the bottom yeah you're operating brand and I like like so and I'm sure and then because that leads well I don't want to yeah I'll just keep going I don't want to brand operators brand operators right and then that's what we're sort of saying is they're thinking about operating a brand you know we break it up and the founders when they operate a brand want it to tell the story of their life you know what I mean like and then marketers do this or like yet so we're going it's what and I the terms I've been using is like IP or brand operator so like you know the people operate super operate like a brand team really yeah like well this is this is what we're doing and it's not break snooping a brand it's peace IP there is probably a snoopy brand as well okay only my brand does this one thing what is it we do that nobody else does it is that question about like like service like the particular thing that you're it's kind of like a usp your unique selling position so like the example I was using KFC which is like KFC is I don't know this is true I think I think I'm going to make this up 10 years ago to be using workshops but like for people who love taste only KFC is finger lick and good because it has 11 herbs and spices right and it's a secret sauce yet well finger lick and good is a great usp because you don't lick your fingers after a burger or pizza like you already really lick your fingers after eating fried chicken because it's got so much and the spices sort of plain to that as well so finger lick and good like no other fast food restaurant could use that McDonald's is finger lick and good doesn't make any fucking sense yeah it only works for KFC and it's their unique selling position right is KFC is finger lick and good right nobody else could say that about the brand I read Roosterwood struggle to say that about their brand and they sell in essentially the same product with some difference with spices yeah so like you know and then for people who love taste right that's a that's also a great positioning thing because it's like this is not food right like the rules of food and counting your calories do not apply here this is about taste and desire you know so so that's kind of like that sort of conversation so well I'd say that no other brands are building living breathing interactive brand worlds like hours after client engagement yeah like that's unique yeah yeah the brand world thing it is say good I did still let off columns design studio but everyone's talking about brand worlds yeah yeah but then so that like can we say only we do brand worlds how do we know but what we're what we're doing like the what the platform spits out is a is a brand world that is like alive in a way and is interactive and is like you're then able to like visualise in 3d what like kind of what the workshop is done you can kind of able to like go deeper on like certain parts of the context and print things out and like modify it in a way so I guess yeah you could say like so yeah yeah that it will have a sense of sounding like what we do is deliver a piece of software is my thing I suppose like software is part of our offering yeah but it's more than that but I don't know is the software like the 11 herbs and spices or yeah well okay let's jump ahead to that conversation so is there because creative strategy design and technology combined in one is that our 11 secret herbs and spices yeah yeah potentially is it those three pillars of sort of thinking or is it out because of that we're cross disciplinary without naming the disciplines and then if we're if that's the support so 11 secret herbs and spices don't forget supports finger lick and grip because you can lick those spices off fingers so the because has to be proof that supports the usp so for brand operators only my brand does this one thing because we're creative strategy design and technology or we're yeah cross disciplinary or we're like well it's something about kind of like like delivering like delivering you know in a unique way right so like we'll we'll deliver a product or a project with those three ways of thinking so it is it doesn't does that make sense yeah yeah it's like I don't know what it is it's like kind of like that methodology of those two worlds combining well I mean it is on this page creative design technology yeah like it is at the heart of what we do like I'm throwing out there I mean when I did this I was like it's those three things right that's where I landed on but it's like I don't want to just rewrite what I've written on one of these before but one of the I mean one of the unique things about it is like often in like agencies like you guys were functioning silos you know creative and strap would kind of crossover yeah um but then when it comes to an execution perspective it's usually you guys would be like coming up with all of these ideas and then later on we would take it to an execution house and then it'd be asked to be in a position to go yes that's possible and I was not but what the company does is it kind of pulls that conversation back into focus so it's thinking about more like the end product at the start the very start of of starting a company so it's it's almost kind of like for reverse engineering the production process because the fact that we're talking about like building immersive worlds as part of the same conversation or what our brand is before it's even born that to me I think is unique so is it like only we start at the end and work back or is it because we started the end and work back I quite like that yeah yeah yeah but is it only or is it our usp or is it our because I feel like I I feel like our unique selling proposition is that like the timelines between like like messy ideas and coherent strategy inside world is collapsed and the which means the time investment in the cost investment is lower but yeah results are potentially better yeah I just I worry going down that we do it faster and cheaper out because when like I get it as far as AI is powerful that's not how I want this brand represented all this brand that's the right to the bottom of the barrel yeah yeah no I want this to be more like where we're different yeah and we're not necessarily luxurious but like you're paying for a quality product as soon as you start talking about speed and price quality then gets attached to somebody's brain as well yeah yeah and there's a good point to make because that's what we want to AI to be like not like comparable to the other things that exist out there just more more human more personal more so the people like that kind of extension of our own personality yeah and among people look at it it's like oh this is a pie and off this isn't like a race to the bottom of the barrel yeah what like and and that's where my building for ourselves are building for million people it's sort of like oh okay there's all these tools out there for millions of people but this is a boutique offering that will be specialized to me yeah the opposite of AI slop that's the way that I say it yeah okay yeah anti-slop okay so like starting at the starting at the end and working back it's like is that begin with the end in mind it's one of the first principles of yeah it's really effective people yeah and the seven habits of highly effective people yeah I worked with a guy whilst and he used that book and the Franklin Covey system and we had to do everything in that way and I was like and when I started I was like I was only that was what can be building building brand for about six months when I started I was like this is so fucking corny but by the end that's what's made me go to this by the end I was like this is fucking corny but just committing yourself to a framework gets result oh yeah yeah it doesn't even matter if it's a good framework or not because you're actually just it creates a discipline around as well yeah yeah so I don't know but that's that's me pushing a particular angle just because I'm you know I'm down the bottom the barrel right yeah for what I can't bring to the party so that's just my that's my perspective I don't know if that's necessarily the right thing to um going there well I think it would like for me um I mean I've always been different from other strategists in terms of like people have called me like actually more actionable because it's like I want to know what the end point is before yeah we go in and so the self so like that's true for what I sort of think about sort of strategically is like you know like well what it where does this where not not like oh this sounds cool let's see where it goes it's like let's know exactly where it goes and make that part of the self yeah so I think it's effective in in business as well particularly from an execution so we're still on that usb thing right so because we start with the end of mine right and then because I cannot make an argument we start with the end of mine because we're a creative strategist a designer and a technologist you know what I mean like only one guy is interested in having the discovery center session um only my brand does this one thing like what you know and is it the cyborg is that our usb oh yeah you know I mean that yeah they got we you know put human into technology we they you know so you know and then it's like for brand operators only my brand keeps humans in the loop yep in the tech loop because we start with the end of mine but then that that things aren't really supporting that thing as well but like you know we can work I can work on that that's that is what a i's actually pretty good at this put those two things in there you go how's the support for the thing and they're called will go and I'm really connected was I don't really like it will actually give you good sort of good sort of advice as well um something about something about like did we tailor personalized brand experiences yeah it's not it's not a cookie cutter approach in a way like it it takes it takes a framework but kind of like it's it's like the personalization is kind of nested within the framework so it's not like oh we just apply this like we take events like oh like within each element of it is like the kind is kind of like an intelligence and recursive loop that like you kind of like really nail in on what the core of it is like um like high touch high touch AI right high touch high touch means like if you have a project that needs like a a lot of attention high maintenance yeah okay yeah yeah yeah yeah um like if you like say if I go to go on a project for example and I go okay I know that's easily something that Lou would be able to do yeah just be able to provide or breathe provide the results then she will be able to execute yeah or if something's much more complicated and needs like my particular brain on it I consider it to be like a high touch project where I need to my skill set in knowledge based needs to be heavily influenced in in a project yeah so kind of what I feel like we're talking about here is everything that we would do would have a high touch of human element interfacing with with AI yeah okay so that's that conversation the next thing is about campaign strategy yeah yeah yeah yeah yeah where is it um just like right yeah right in the hallway and then right around we don't have any toilet paper but like you don't need you don't need toilet paper no okay cool I've got to go and buy some what's this have you over um again so the next questions about campaign strategy right so every brand these are the four drivers of marketing success and which one do you need do you need more awareness or do we need relevance as in people so awareness is more people having heard of us right relevance is more people caring about us and those are drivers of consideration right you don't really think about buying brands that you've never heard of and don't like right like if you're going to buy something and there's a choice there and say I've heard of that brand and I don't hate it you're more likely to choose that one that's consideration of like yeah what I consider buying that brand and then the other two measures are conversion which are penetration so more customers so more customers that you've never met more new customers who aren't buying you today buying you tomorrow or frequency which is a customer who's already buying you buying you more often or buying more or like you know so so those sort of things so like what what what what is our brand need from a campaign point of view like you can make an argument for all of these because we're you know but like what is the most important thing that we want like we need all of these things but what do we what what is it the heart of the sort of campaign is it like do we need awareness or do we need new clients yeah between one of those two yeah and and does it have to be one um not necessarily you want to be single minded like they're and they they're late but this is important to figure out because like a lot of people that we'll be talking to would be be new brands right yeah so in response will be the exact same as ours which is or all of them yeah so but it's like well what is the most what is the most important for for your business do you think so like you know this is going to come with like crystal like you obviously need all of them but then from a campaign point of view is being single minded about the one you want like if we're like if we tick awareness right then what that leads us to is let's get our brand and logo everywhere right if we tick penetration that's like this is why you should hire us see what I mean like it's it forking the road addressing yeah yeah yeah okay cool and then you know anything that you do gets awareness anyway like they're kind of like because you can look at that I like say like like to me that's like almost like wider than Kennedy and Nike right like Nike wants to be absolutely everywhere but white and Kennedy just wants the business you know I mean so yeah it's different like you don't you don't go fucking down time and see why I'm Kennedy's logo yeah yeah yeah yeah and like because we're a business to be like we don't need general awareness totally totally what we need is the one client and good result for them and then three more clients come out of that so really really it's more penetration and frequency we want you customers and we want more like yeah we want to like what do you call it a revolving door of new customers yeah well and that's great agencies I built on the front door like as in like let them live any the back door is irrelevant there's always this people coming in the front door we don't care who's going out the back door really yeah so as long as we got people coming in the front door of course like oh you know like it's like well relationships not working fuck off you know I mean because we can replace because we've got you competitive coming in the front door and we'll probably make more money off them anyway yeah so it's not like it's not like bad service it's just like well relationships run their course yeah do you know what I mean like so I've been with it okay cool so how would we measure success like how would we measure that we're successfully attracting new customers obviously anything other than sales okay yeah like any because we're talking marketing well to me and so this is like this conversation is really interesting what you want to put in there is a lead measure not a lag measure so you know the the the canary in the in the mines yeah so the canary runs out oxygen dies miners run for their lives that's the lead measure like a sales is a lag measure because you can only measure it after it's happened right so you want a lead measure of penetration so what is the lead measure of penetration was that that's like booking meetings and right like it's just an up or meeting so presenting our brand's potential customers yeah right yeah and then you can wrap numbers around that yeah or whatever but also like the right level of clientele interest look well interest interest is difficult to be able to gauge but if you book a meeting and at least do they have a tangible number that you can work with you know so like maybe we go meetings and presentations with the right people like we're not just like straight out we want to have meetings and brand operators yeah and so with the right people and that gets respect to what we're talking about for maybe we need a client hit list of like these are the clients we're desperate to work for for sure we put 500 on that list we're trying to get 500 potential clients that we want to target on that list and we go where we want to get 100 meetings you know what I mean and that's two meetings a week yeah like so we go yeah okay cool so that becomes like you know that that becomes that okay so um what's the problem that we've got to overcome to get these meetings and presentations in the diary um but the confidence in the person that they want to have the meeting with us the belief that the um been taking the meetings and we worth their worth their time so there are to have some agency already in place or feel like they don't believe that they need us all they think we're going to be too expensive this is um one we didn't we haven't done I haven't shown you this process yet but there's a process called problem identification then I do is like we go you got to write your problem statement like that how do we right and the process of problem identification is like list everything then you cluster it um and you prioritize and then you define it right so like this is a if you do this for an hour you with a client you crack the problem every time so okay you know what are all the things that are going to prevent us from um getting meetings in presentations with the right people so you know not knowing us I already got an agency thinking that they don't need us thinking they kind of fought us don't need us kind of fought us yeah not the right fit not right fit don't understand us like don't understand what we do don't understand that offer yeah don't like our work don't have enough work this all feels very don't like right and so like we could keep doing that list but we will probably just be thinking around the same area so there's like you know they don't know us they don't like us yeah um they kind of fought us mm-hmm um um like us fit they will kind of turn on the standards like they'll kind of fit in no or like us kind of fought us uh oh like got an agency right cool so that's the cluster which one of those is the problem we want to solve but we want to do we want to be known do we want to be liked do we want to be affordable I know I can say we're going to cross that one out now um or do we want to be an agency killer I think with where we're at right now it's Nois so yes yeah okay do you agree um yeah well let's get back to the awareness yeah yeah like you know and then we're gonna okay so if they don't know us the define there's a process called the five wires right which is which we're gonna have to why five times it's not more genius than that but these are really established processes that all are consultant-shoes as well okay uh why do we need to get people to know us so we can get business yeah do little cool projects um okay so you go get business why do we need to get business to grow the business to grow yeah why do we need to grow so we can make money yeah make money oh but also um have cultural relevance as well um i'm gonna cross out make money and go cultural relevance right why do we need cultural relevance um because it uh proves uh authenticity and signals are credibility yeah yeah it um places in the place that we should be placed what would you say proves authenticity and signals credibility signals credibility right I like that word right now this is what works right it's still at university there's so many words that I remember but I just don't really remember how do we signal credibility right that's up when nobody's when nobody knows us and we don't have any work yeah right so then it's to deliver in in Santa Man a value up front yeah well and that I mean that's the next other thing right so uh the real problem is you know how do we signal credibility with no work I'm just gonna write signal with no work this this thing is not gonna be very useful I'm just realizing as we do that as like are the actual written thing that I'm writing out other than for me to refer to it and type a deck out of it okay that's more like what's getting captured there yeah yeah and that's actually the value of the you know but some clients would do this in a really neat kind of way and that's something I've good to think about in how I lay out the form because I've kind of laid it out just right over the gray bit and as I'm doing it myself I'm like that shit doesn't work right okay so that's problem identification right what's our strategic solution to how do we signal credibility with nobody knows us and we don't have any work well we leverage off our existing portfolio our work or our existing um credibility within our with every our existing businesses yeah yeah yeah okay cool because that actually makes a lot of sense too that's something I've been thinking about is like each of us have got a a brand mine has no clients or anything but each of us has got a specialized brand you know what I mean because mine's in retail and architecture yeah so like yeah okay so our strategic solution is leverage existing businesses and build on that sort of credibility as well yeah my my answer would be slightly because I think there's a possibility here where you could like for like encode outreach for like a small amount of money um like you could have a like say you would spend five dollars worth of token costs to have an automated system that would like research the brand look into like kind of like place them in kind of like the market share mine share place the meetings they competitors do a bit of research and they uh do a first pass and like putting that parameters through the engine and outputting something and to be like hey we did this in five minutes with what we could find on google if you sit down with us for two hours we could give you full full thing so we kind of like give like we give 95% of it up front and be like all right if you want the human element if you want this so then it's like the solution there is like a spec work that's you know spec work spec like speculative work here's an idea we'd love to make for you and you send it to people yeah like like it's the like you you're doing a creative presentation you haven't got a brief walk because I'm I like I'm a big fan of that approach yeah like you know I go when I want to understand a marketing problem like we do with hatred I go straight to the creative solution and I'm like this just put that in from the client watching respond you know what I mean like and then out of that response will go okay cool they're never going to buy anything like that or like okay we've just got to make that idea that they love affordable now figure out a way of sort of doing it as well okay so I'm just going to write spec work for you know and it wouldn't be a shotgun approach it wouldn't be every every business in Brisbane it'd be like all right this is the list of the say 200 companies we want to go after this month yeah let's let's let's put our system towards let's let's build it out let's let's provide like like yeah instead of being like oh because like that's a high friction thing to be like all right pay us five grand for the month and we'll give you this like yeah give you most of up front and then if you want to step like actually build it like and actually like tailor it to what like where your guys heads out and not just what we've come up with externally we can do that well and that gets us back right to what we're talking about at the measure stage is we need a 500 client hit list right that we're just like churning through or even the AI is churning through is like okay what's that 10 per week so write us 10 speculative presentations a week for each of these 500 clients like you know what I mean like and where you could almost maybe that's how we fine tuned AI engine as we go here's our hit list scroll through it do some research and write a strategy based on the you know the quality of information you can get for each one of these or ten at a time you know I mean we look at the app port and we get ads and that one we just fire it off like send that to his we've got the clients who contacted us so yeah the only thing that I'd say about that approach is that that's not using what I believe to be the sub-factor framework wholeheartedly in the sense that there still has to be like an element of human refinement so yeah yeah like to me that's not really showcasing you know yeah yeah it becomes a little bit more laborious of going we're going to put this through a human or we're going to spend half a day or a couple of hours with a yeah then refinement and then I'd feel comfortable putting putting it out because then there are actually kind of we're representing what it is but what if the specwork was like hi I'm an AI and I work for sub-fracture the guys at early agency have not even seen this presentation they briefed me 12 months ago to do specwork and send it to clients if you'd like the humans to get involved give us a call that's interesting yeah I would still want to have like some sort of QA on that yeah I think most I think most of those emails would be like delete yeah yeah yeah like I don't think they'd have a high hit rate but yeah it's also like it's also about kind of lining like how we present ourselves to market as well yeah I get it from like a hitless perspective of like you know needing clients and having a good quantity to go through but you know there's one thing of like sending our email for someone just automatically just delete because they're like it's just another inbox versus sending someone an apple with some sort of a message you have to write it you know whatever that first touches with the brand then I want it to in my opinion I want it to represent the brand correctly and whether that's being like meeting someone at an advertising conference or having like you know some sort of cool experience that sent them like really hiding in on what that first interaction looks like and treating all of them like it's an immersive experience I think is yeah I like that I have some of the words around it but I like the first touch like how do we signal credibility with nobody knows us that's why we're actually the first time they see it's when they're impressed yeah so like you know like always be always be impressing kind of thing is like you know first impressions count but it's an opportunity to it's like when you meet somebody for the first time in a fuck you're a cool person I don't know what it is about you but I'll like there's been people in my life that I've come across for I'm like I've met them once and they'll kind of just stick in a part of my brain yeah that's how I would want to look at like introducing this company to people for the for the first time yeah yeah we create that moment where they go oh that's cool you know I mean hit and stick so but at the same time what I'm talking about again it's like super high touch yeah what I think it'd be really interesting is how do you combine those two yeah ideas together I think you could do it in a way like you've got humans in the look like yeah yeah that's that's that's it goes off it works on it for the power alone it kind of comes back and tells you hey this is what we're looking at you're like oh well yeah it's kind of there but like go again go again go again and play until you get to the point where like yeah maybe you've put like an hour or two into it for each client but like that's time well invested because now you've got like a nice tailored like mind-blowing experience that you can just drop into the inbox go hey we basically just delivered you five thousand dollars worth of value do you want us to keep going yeah yeah okay so the solution I wrote is leverage existing business we're gonna cross that out and put like you know make a good first impression okay you know yeah make great first impressions yeah which is wildlife like like the meeting with like crystal for example yeah like that's such a fucking wild opportunity she's like it's it's almost like she is who she is she's got a lot of the tech guys just Adora like she she is a doorway to clients yeah if we that's what we're going to do with crystal is get her going oh yeah they they're still logo on my brand in a brand book for my skincare brand yeah it's fantastic you should call it it's a cool experience yeah yeah we need to yeah and it's like we we need to be thinking about that as we sort of go into it yeah do it around okay so you know make a good first impression yeah that's cool because that also then drives the strategy as well for awareness go ahead we need good first impression yeah and like maybe we actually ask people to give us feedback on the first one what do you think of this yeah before you met us what do you think of us an hour after you met us what did you think of this after we delivered like you know and see how that's gonna change as well okay so we need an idea that does this and these are the tactics we could use that those are the next two to the questions so you know for our campaign what kind of idea do we need so like this is a real question for clients you know because like tip analyzer guy he only needs some kind of idea like he doesn't need the full blown sort of thing so I just need to be simple and affordable or like man needs to be shit hot and there needs to be sort of great as well so I don't know like for the sub fracture campaign to launch us what like maybe start with the tactics like what would we do would we do emails like would we do an ad in the trade press like how would we drive that measure and get those sort of meetings yeah my my approach with this is to launch with some cool work yeah so the first time that people see us they can see what kind of broke because anybody can create a fucking brand these days and say yeah yeah and fall agency my whole thing is like don't say anything to anybody until we launch with crystal have no you know I mean like that next and next sense then we've got something to talk about so we need an idea that demonstrates our work to me yeah to me it's two phase one the first the first bit would be like have something cool to talk about yeah and the next would then be have like have some sort of like offline thing we actually physically getting people to get up so but no I like the idea and idea that demonstrates our work right the tactics so we've got an idea that demonstrates our work where are people seeing this idea that demonstrates our work is it in the trade press is it on our website is it are we pushing it out on social like we're the brand of areas I mean I I like the idea of kind of like like highly targeted highly personalized kind of like underground viral transmission okay that is a lot of wise but I loved everyone yeah so like yeah that you go you go to someone who you know as a brand operator you know who knows a decision maker and you know as well connected and no yeah you deliver them something that blows their fucking mind and they go holy shit there's five other people who need to see this yeah and then they email it to them yeah and then they see it in their holy fire yeah like these guys are changed the game yeah they they pass it on to five other people and then all the sudden yeah when when when when imperfect circle got a sporadical in and I was seeing a poor yeah and I was just dead and no that was the head creative that a few weeks ago not be not be yeah and and like the the fact that we went and pitched a spry when we were up against I think like four or eight agencies like you know like Ogreville and come over there once were yeah but we literally left that presentation we went to a bar and by the time we got to the bar we were in like one dream deep and then the guy from Coke called us and said they've got the Sprite account which was something like a two million dollar account right great brand new agency massive account like instantly yeah it was just to do with the fact that they had like cool people in the room yeah but I was like pushing immersive tech like we had like a yeah or a reality demo we had like these ways of being out like getting a fire rubbish collection or like these massive spry activation so yeah spec work combined with talent um and then obviously like trusted existing relationships yeah yeah but it kind of blew my mind out quickly you can land in the account like that with a company that literally was like set up trading like a couple of that that's like this word coke collar I co-cola is a great company and they do great things and one thing they've done from day one with the Sprite brand is like you are not Coca-Cola you take risks you do the new things Coca-Cola is going to do the most tried and trusted things because it's the biggest brand in the entire world and we ship it everywhere it's never going to take a risk Sprite you you go crazy yeah you go risky because you're not even defensible like you're not better than seven out everyone's got 11 a like you're not even a brand like the Sprite brand itself was there used to be like a cherub in the coke ads that was called the coke Sprite so it's named after that cherub so it's like you you are a hundred percent the risk taking off shoot of our cola brand but there are a kind of opportunities that you want to look for right way yeah like companies and brands are just tied up the same old shit that you know agencies put in front of them but if you go in there with like a fresh idea or a fresh take I mean like I think in perfect circle was super innovative for for its time yeah now I don't think that that that same formula would would hold up but there's an evolution of what that formula is which I think is what this is yeah so it's just about kind of getting in front of the right people that are the Sprite hold their industry where they're like yeah you guys are fucking crazy I like what it is that you're saying I know that you're going to do a good job based on your your history and you're crazy and everything else has kind of come before you yeah I'll take a risk on you we need three of those we have three of those that have a cool fucking body of war and like weird ones right like tomorrow lands going to Thailand for the first time yeah next year I'm asking you in that account imagine doing fucking activations for tomorrow land in Australia yeah yeah to try to give people over there so like things things like that just yeah yeah and there's like a there's a new park that's open up and go some newy which is called the experience which sounds wild but it's just like this weird kind of artistic thing by anyway I think things like that that cool I've been coming but then you and the only agency like you guys that are like small and nimble and are thinking about all different elements would be able to deliver on and in a way that other agencies want to be able to do yeah okay so that is section one um the administration it worked and then like just from that sort of conversation right we've got the strategy brief is we need to signal credibility before we're known our solution is be impressive from the get go from the very first step and the execution we need is a demonstration of our work that's shareable so yeah there's someone who I want to pull into this loop at some point she got a fashion brand over in WA she's like dresses like gaga and beyond oh really yeah yeah she's fucking wild they became really close to where I was see like crystal skin care brand is not going to set the world on people are gonna like you did this skin care brand that is what will be shareable right is I go like you know the the indigenous sweaters the wild wild sweaters like you know like just that that's the kind of client that you get that is like oh wow this is amazing and different stuff like that yeah okay we should yeah we should think about that because she's fucking cool and she would be like I got so drunk with her at a fast and her and my other friends is producer we're just like like hanging off each other at a bar just going we're gonna change the fucking word of advertising yeah but you're gonna fuck it flip everything up so down I ever created a group challenge to grab and then the next day nothing happens I'm like you guys remember we're gonna do that like don't talk to me right yeah yeah she would be well well fashion as well like it doesn't need to make sense like yeah I've tried to work in fashion just through Dave just through different things like David Jones and stuff like that and you learn that this doesn't matter like nothing fucking matters in when you do fashion like there's no strategic sort of solution to making a fashion out yeah it's literally just is it is it about sex or is it not about sex like you know and out of the strategy like oh geez I'm not doing that okay cool so that's page one page two is about the creative strategy right okay so the first that you know what's the measure of success which is what we sort of talked about remember I've written this so that we could start with any at any one of the places so the measure of success we got is like meetings meetings and presentations with the right people and we're talking conversion yeah so like with the right people yeah so how will we measure that is that like so you know increase measure from X to Y by when like is it like we're talking about 500 people in the hit list to mean some while to maybe that is sign contracts right yeah increase like yeah so signed contracts and then how many signed contracts do we want you know by when that depends on how much money these are the contracts they're worth well signed contracts yeah exactly yeah what do we want to make in like this just took the first 12 months like do we run a million or half a million or 10 million well I think half a million is probably more realistic yeah okay not that I want to like put caps on dreams or whatever but I think no but and it is to mean is achievable yeah yeah so definitely year two then you'd be able to go two million I reckon quite easily yeah like it compound pretty good and they you can see for us we're just talking shit but when we're talking to a client it's like well how much how fast do you need to grow exactly because then it's a great conversation because if they're like oh we need ten million dollars in the first year it's like well that's going to cost you some marketing money and like you know we're happy to have that sort of conversation where it's like oh well we've got no money to spend and then it's like well you're not going to get ten million dollars in the year without spending money on marketing you know I mean like and then you're already into that conversation which is like look it's just I mean we it's not we're not inventing this there's not a sales technique you need to spend you need to invest to create your sort of branding sort of thing which means still like a good conversation but I mean like that seems achievable like ten clients for with a 50k budget yeah that seems very fucking achievable to me yeah ten times 50k so we want ten clients right which is but the other thing that then drives that is that we then know the kind of conversations that we want to have with people yeah to me it's not about having 20 clients for 25k yeah yeah you know yeah whatever the other math is yeah anything under 50 grand I don't think it's worth getting a bet for well and then yeah I agree but then I'm like oh well how much of this is revenue and how much of it is profit yeah that's a yes and the first 12 months everything's going to be re-invested into the business anyway yeah so like you know that's just the question like you know do we because if we go we're far from going profit then we need to make a couple meals are you talking turn up with that five hour okay well I don't know I mean I just turn over yeah okay cool and then aim for like 20% profit yeah taking into consideration salaries like the idea yeah yeah everyone's been paid to these salaries and then whatever our sourcing for free lenses are whatever overheads of running the company is yeah 20% profit yeah yeah yeah and then you know like it leads to just a certain amount of money very much this days yeah I know but 50 but it's also pretty comfortable for Brisbane like you know I mean like if we're talking to Brisbane clients and trying to chase them up like if we go out to LKSD that I was just talking about and like we just want a 50,000 dollar project off you that's not a massive ask it's not like I get out of here you're crazy where no no but I think if you ask for anything less than that then they won't take you seriously if you're like ending more when you don't have crates I think is unrealistic yeah well that think about thing that was saying like 120 grand that was the agency fees so 40 grand for credit you know for this for strategy 40 grand for creative and 40 grand for production yeah and that didn't include any production or media costs as well and that's 120 grand but you know they're sort of established okay cool let's keep moving so this one like is the next thing is like and this is something I want to train clients in because it's a really useful thing is like okay you want to you want to find some this is effective surprise this is how creativity works is how fucking jokes work there's an insight right which is an observation into the mind and behavior of the target so it's like an insight has to be a new discovery and people often get caught up on that like there's nothing new in the world but it's like the way I always describe it is you know Jerry Seinfeld the way he writes jokes is insights right and he's like Jerry's one of his jokes that I always use as an example is like you have been a restaurant and you've seen the specials and you're like if it's so special why is it not on the menu that's an insight you know what I mean like that because you just putting a little you own little twist on on on what it is and the behavior of your sort of target as well so I've actually got an insight which is like glattering to this which I actually really like which is if you're like operating a brand is a deeply personal affair doesn't that like as in if I am the junior marketing exec and the new ad goes live I'm like guys come on look at the ad that you know my company that like that I was involved in and somehow and that like feels like a really useful and interesting sort of insight and then it's also why we want to use human intuition and stuff like that as well so you agree with that and then what's the truth about our company right and so this is where you'll come back this is almost like a flip of the in the usb rewrote keeps humans in the tech loop which actually feels like a good truth for deeply personal yeah yeah cool that's a nice fit right and then you go I mean this is how you come up with ideas you okay cool what what's an interesting combination from brand operating is deeply personal and we keep humans in the technology we create deeply personal technological experiences yeah is there something about like story telling in there like like stories that super personal yeah and something like like storytelling has just been done by humans for such a long time that's that that's just where my brain goes as far as like those two things can buy something being hot that super personal um what was that one personal one keep humans in the loop yeah well if you're doing something super personal you want some human feedback right like and that's kind of like when you have an idea and it's percolating you know you go to your partner and your flatmate and you go hey tell me what you think about this um yeah true and you're like bounce ideas off off each other yeah um bouncing ideas of other humans right what if we were to just went the interesting combination is bouncing ideas of other humans is fun bouncing ideas through technology is fucking not fun it's it was fun oh that's fun yeah you're like that more like a bold level now man I think yeah I think about you a lot in the points that I get to a GPT or I'm like I think that this isn't funny more because I know that it's better way of doing it yeah it's so much fun for me because I've kind of made my system just an extension of my own brain so I've taught it to see the world the way I see it and to think about things the way I think about it and so even when I go on to like the chord chord A.I. on the web and I try and talk to it it just doesn't fucking get it it's not it's just like the kind of intuition that it feels like my system has it like where it's able to just like kind of get to the point where like where like oh yes that's what I wanted and it does it the first time most of the time is it's not there because I'm kind of like built this thing that's more just an extension of my own brain yeah yeah yeah yeah yeah is it that like the human touch makes every idea of that you know right and then you go that makes it sound like we only do the human touch and we don't use to the technology yeah so it's the marriage and it's the dance between the two yeah but it is really interesting right that we go so it keeps humans in the loop well it's in the technology human touch makes every what if you just go the human touch makes technology better and then like you know you're almost in um yeah like you're almost in the panochio space here which is really interesting you know I want to be a real boy like which is like you know or you know whenever someone does story telling about a piece of technology that they humanize it it's the piece of technology wants to become a human or loves humans in some way you know what I mean like and that's panochio it's just been told those were like you know the astro boy is panochio even as dad like panochio's sort of dad as well like it is like yeah human touch makes technology better okay let's keep moving yeah like that I like that okay cool so here's where we talk about the layer that's what I was resisting story because stories one thing oh okay right yeah story culture and storytelling has become a bit of an overused word no no like but technology might bring it back as well yeah okay so thinking about these layers that we've got you know so the first question is the core what's our North Pole and then we go into each of the layers so what is our North Pole in what sense so well what is it mind blowing personalized brand experiences brand worlds brand worlds yeah okay brand like what is it what are we driving towards every day so like I'd say back on that kfc example the North Pole of KFC is desire oh okay yeah like and because the North Pole is desire it allows them to put a lot of sexual innuendo into their advertising do you think that there's something in it like if we're talking about brand operators is to be understood like you want to be heard yeah and and you know to engage with an organization like sub-frax for people to just kind of get it and get it really quickly and then because that's whether that's whether the real strong alliances and business come right when you when you when you're on what your company interfaces with the Nelly company and it just kind of clicks and usually that's you know from a supplies perspective it's just understanding what it is that what what they want you know whether it is to sell more chicken or you know yeah make more cars or you know whatever it is yeah but if we can help them be be understood well I think the North Pole of a traditional advertising agency up until recently has been like we we work on behalf we represent your consumer you know they like so like we don't understand how you make widgets we understand how people buy and use widgets and how that makes them feel and we understand that better than you because you spend too much time in the factory and not enough time watching people use widgets okay you know and like that usually when clients as a sort of like the David Ogre v thing with Avis is the classic when he took in a he took in like a little framed thing to anything they can go to the CEO he's like want you to sit this on the desk and these are the 10 rules of our relationship and rule number one was like I'll admit I know nothing about the rental car business if you admit you know nothing about how to make ads right and that was point one and like then there was like about seven of those things and it's like one was nice and like you met him he showed him that and he agreed to that and then he put that down and he's like okay here's where number two and we try harder and in that presentation he actually invented position because the only thing that branding that I'd said before was like when number one where the best and he was like when number two and like and that was sort of like and that's where positioning began everyone's like oh you can you can use your market position or you can use any sort of thing for positioning yeah okay cool can I ask is it specifically North Poland instead of North Star like is it is it that there's a North Pole because there's something that is polarized against or is that just now you could change it to North Star and like it has been down as well I use North Pole because we're talking about worlds yeah you know and the North Pole is the like in another deck I talk about orientation and stuff like that you know like so no there's this is a kind of a place where you magnetize towards yeah yeah I mean you could put in you know you could put the word purpose in there again as well like you know you could put like a variety kind of things in there so yeah it's not I think and North Pole I think just lends itself to presentations more because the North Star is leaner isn't it anyway it's different difficulty illustrate but so we haven't landed that one yet ties off on his messages so we're still on the North Pole question um yeah but you guys were talking about North Pole North Star yeah I'm not that interested why I agree with that I honestly was did I never know and then I figured you guys were going to talk about it too much so we took some of the stuff well what do we think we've got we're talking about brand world being understood like like you were saying people get it really quickly and things just kind of clicked like um is it about being easily understood is that North Pole like it hasn't come up anywhere earlier but it doesn't mean like are we making things easier and more understandable is that what we're about hmm like we're not making things more difficult and we don't want to make things more complex I feel like it's something around like we're making things like more personal more authentic more human more well yes but also it's more it's more supercharged you know like it's the idea of like it's like it's not just human being it's a whole like cyborg direction right like so is it cyborg is that like you know cyborg and cyborg's not a good word but no no but it's it just it says humans and technology combined and like we don't use the word cyborg but we go it's a good for reference though yeah like what is it it is it is it is personal then but then highly powered by AI so it's whatever to me it's whatever that intersection is it what we're talking about right now which is marrying messy human intuition like with like a van on yeah simple that character they both need each other to survive yeah what if we go at marrying messy human intuition with technology that makes things easier and simple I'm getting visions of like a like a human but like an Indian god like eight arms you know more like like you know and like at a table last airbender how like you go close blue and then go some the avatar statement they would access all path to the sense of himself yeah yeah like the kind that this kind of like merging of like a human consciousness and machine intelligence but in like a human ledway yeah like keeping the soul the core kind of yeah it's like it's like human to the power of machine yeah yeah yeah is it keeping the soul well it's to me it's like it's almost like what is the machine's soul look like you know like how do we like what's the beating heart of the of the machine like it's not going to exist without that human element yeah I guess actually there's something in here because that like all of these AI companies that are raising billions of dollars are trying to like optimize the human out both we're putting the human at the center and kind of branching that out like scaling that human up rather than being like oh this human has nothing to contribute yeah we're gonna be way smarter and you're gonna be useless two years time well do you know why it's the difference and it's kind of cyborg again but it's the difference between a robot and someone that has an exoskeleton suit yeah you know I mean like what where the exoskeleton suit where we would be yeah we would be the exoskeleton suit something that has the human in the core and in the heart yeah but it's surrounded yeah like what you were talking about surrounded by technology that supercharges you as opposed to going I'm gonna make a robot over here which is what I feel like all these AI startups are doing yeah I like isn't the heart knows is that out of no stuff that has nice you know what I mean like that's like like it's like yeah yeah we use technology we will fucking technology shit we'll ratchet that as high as we can with your technology but we just want you understand that you'll know you know you know you don't really like the heart it's heart led and it's led from like a story of value yeah yeah based in the heart and based in the human experience yeah which I think if you double down on that it's gonna be really good because people like know that no matter how smart these machines get for now anyway they don't have that essence of a beating heart or yeah you know like that idea of intuition and you know like yeah that that gut feeling that guides you in a particular direction it doesn't have that I'm not saying that'll never get it potentially for one day but right now wherever I which is to be is what the point of difference is that where we still need that kind of instinct yeah yeah yeah that's all and that's first going and making different yeah well that's like that I mean that like if you get into the psychology I don't know if I've gone through this before but like intuition is powered by perception and memory right you remember things and you perceive things and you see them sort of differently but perception and memory inside the human brain is like what's called a quantum entanglement and it's like the chicken which came first the chicken or the egg because you need your perception to build your memories because your memories are events like people and places like so your perception is critical to build memories you can't build memories without perception but you can't perceive things without memory so like and it's just this mix-up thing right that I believe AI is never going to be able to unlock because the intuition that leads to this kind of thing is coming from it could come from childhood experiences it could come from something you did yesterday you know I mean like it's not a value based sort of thing as well so yeah okay well at some point I don't think a computer will be able to experience emotions like as humans with 5,000 years of research we still cannot explain emotions like the emotion love goes against every scientific principle like the scientific definition of love is to care more about someone else's life than your own and like there is nothing in the history of the science that can explain why a creature would do that and we and it's not just humans you see it across the entire sort of animal kingdom happening right and nothing in science can explain romantic love like you know that that sense of feeling right and it's like you think about the role that romantic love plays in your everyday life you know I mean like you think about it if I can a hundred times a day it's the most important emotion we experience and nobody can explain shit about it like I just think emotions are like technology will never be able to experience emotions therefore they can't really play with emotions they can't really go off this human is feeling that right now like like humans can't be that you don't mean like for all the for all the things so I just don't think any technology is ever going to be able to cross that line and we replicate genuine human emotion okay we're gonna agree and disagree on that that's totally fine yeah yeah but I think what you're talking about particularly is literally the heart of what is that we're talking about yeah the only thing that's different is that I believe that some day some sort of synthetic version of that will will exist you're saying that it won't but what we're talking about is that that essence yeah yeah is really what we want to kind of capture in in our work yeah being out of figure out how to yeah so you want to agree with me for the benefit of our brand don't you well I'm not gonna agree with you but yeah I'm gonna agree I just just it's really about the future yeah yeah yeah yeah yeah but what I what I agree with is right now is what is important to the brand yeah yeah yeah yeah yeah I think I think we don't have to agree on that I think it was great I think was is over here I think you're over here and I think sub-fracture sits in there yeah yeah because I think sub-fracture could you say that could say that the way to like for machines to understand the true human experience and to understand love yes to be led by humans and for a new consciousness to emerge where it is a blend of machine intelligence and human consciousness and that yeah and an artificially general intelligence system has humans in the loop it's not just this mechanized thing where we scale up our computing scale by data to the point where we're highly intelligent because that's not going to take us towards artificial general intelligence that's just optimizing towards certain values when when you've got when you've got a system that is able to like have impact at scale but is like kind of led from a heart and based in based in a human perspective and so it's it's it's like it's exactly like kind of like it's still there's still you still have Tony Stark but then he has his Iron Man suit and it starts off with that one thing he built in the cave and then he kind of has one he has to get into and then by the fifth movie he's got a whole swarm of them and they can fly to him from anywhere on the planet or he's got nanobots so come like it's kind of like but that's that's still Tony and it's still like it's come from Tony but it's like I like that I like this there's tension in it right because I was just like the half versus the machine and it's like that's what we do every day is we go in and we go the half versus the machine now whenever wins is never a winner they always come out of you but like you know it's not about winner it's like we just have this debate like about humanity and what humanity is and we love and respect that we love and respect technology and we hit them against each other every fucking day and see he comes out with the with the best stuff like you know in terms of like yeah okay next next question that was just the court you see what I mean that was actually a really interesting conversation and I think some of the stuff we're talking about comes back over here you know like the heart and some of that sort of stuff but anyway we'll keep pushing okay what's our story so I've gone you know what's our origin what's our manifesto and what's our narrative but like what's this so these are your three layers story culture interactions so is it I think this might be where creative design and technology go yeah yeah create a strategy creative design and technology um you know what I mean like do we have a origin story or is it just the three of us smett and started it like you know what I mean like is it like well what about fractures what about rainbows and earthquakes yeah and stuff like that is that part of our story yeah I think so yeah so yeah so like worlds um you know and fractures a part of our story so that the fractures and that could take us into the Japanese Icargo thing or earthquakes or like rainbows or broken bones or any sort of fractures kind of angles yeah but for me the story is kind of like it's like the there's a there's a big wave coming and the you need to when you're trying to catch a wave you have to paddle into it when you're not just gonna sit there and hope to just like cruise on into it you've kind of got to build up a bit of velocity so that like when you get on it you can actually ride it rather than just getting dumped and washed around in it yeah and even before that just knowing that you belong in the ocean knowing that surfing is is for you right knowing that you know you know you meant to be out there and that there's um yeah you're just what you're supposed to be that's what sub-fraction kind of feels to me is it kind of feels like a little bit of a lot in a line of words like for me personally you know like obviously you're in case you throw a long time but like you only kind of came into my life like a like a year ago but then the three of us just aligned and then the fact that you were making so much progress from from AI side of things it just like I love it when all of these pieces just kind of come together and align because you've got you know four people that are all thinking the same thing about a particular problem but then having the skills to be able to build you to life as well yeah the serendipity is definitely a it's fascinating the fact that like I was like thinking and working on like ideas in this space for months and then turns out so beautiful but but also I think it's forced serendipity as well even on the humor I'm like you know you know you're keeping me up to date with the things that you're working on and then it's me going okay well I'm in this conversation with these guys over here I'm talking about then it's then it's just like what does this kind of look like you know to together well the fact that you're even interested in AI or you know at the stage of your career that you are because I know that there's people that are in a similar position yeah like AI is bad and I don't want to touch it yeah well I was like that a social media I was like because I was in like I broke like late 90s advertising and I worked at agencies and make great TV ads and when social media is coming in I'm like fuck this shit and and then I did a hyper island course like I didn't do it myself like how agency went through it and they all the guys at hyper island was like that guy special because of the way that like I approached the workshops and stuff like that and then because of the hyper island guys I was like okay cool and they were telling me about Arab Spring there's a lot of them spark they were heavily involved in starting the whole Arab Spring movement by going to these little communities in the Middle East and teaching me how to use Facebook and they like connect up they go to 12 different communities and tell each other where they went and then those people start talking to each other and they're like does anyone like this Egyptian and they're like and then the revolutions started as well so I was like yeah that's kind of cool and then so when I came I just remembered that and I was like okay don't like I know like I am gonna be cynical and like there's a fucking bullshit but like don't know that stop you from understanding at this time around like diving in from day one so yeah you know okay and I remember the day because I was like okay I've read about 20 things about chat GPT I'm LinkedIn in the last three or four weeks and every time I read it okay this is fucking bullshit which is that old way of behaving yeah and I just caught myself and I'm like okay I'm gonna go and try chat GPT I went over try that and I was like instant I was I was like this this shit is dangerous like this is really gonna cause cognitive decline that was my instant feeling but then I showed it to a girl I was working with and 24 hours later she's coming back to me with these really well written things and I'm like Chiniha you're using chat GPT and she's like no I'm not and I'm like you couldn't fucking put us in together yesterday yeah you've written a whole book okay cool um so that's the story manifesto narrative you know uh worlds and fractures are playing a big role as well head and we're talking about strategy creative design and technology um what is our cultural sort of layer where do we belong what role so like I mean I guess culturally here is like um are we are we how creative are we it's kind of conversation we talked about before I think it's like is this talking about like our company culture is this talking how we fit into the culture we're trying to look um why it's like where do we belong so it's like are we um are we part of the creative industries or are we part of the business community you know we part of the entertainments with the industry as well like what is the I mean are we a tech company or are we a creative company that's I guess that's the key question to ask what can I do both yeah well nice what are they culturally the same no no no I like you know I feel like uh to me to me is the ad will ad will yeah cause I like have visions of like going to ad fest next year and like presenting sub-fraxial yeah yeah presenting sub-fraxial to the world and if I look at like the other events or conferences that I've gone to things like um my apple which is theme parks um or I said I'm the ones of into in China like like like like all like AWS or low-end and it's a bit of a valley like yeah literally on theme parks tech and advertising and to me this is a product that will work best in advertising because they're going to understand where this is that we're talking yeah yeah yeah I agree just because like your phone and laptop runs on all electricity but that doesn't mean you're a tech company I see you are the same way yes okay it's electricity yes and that's what some of you know I wish I kind of did I own with with activate right because I didn't really know what kind of company it was building so it's got to all these different conferences and then I'd go somewhere like like AWS yeah um then I'm like I'm just surrounded by the notes there's no fucking clients here so on that advertising world right in the advertising world are we are we like do we want the old clients are we like do we want the code collars that are going to be hard to be or are we like advertising world but the new it's just where the emerging bit fits where the culture we want to be part of is emerging brands and technologies if I give an example of like I had fests this year of like sitting next to say if I was sitting next to somebody like co-coded and co-president there yeah but it's said if I was sitting next to someone like co-coded and I'll see next to my friend who's like in a fashion designer who's just doing like fucked up streetwear that like yeah yeah this level is a wearing I would be like that's the first time I want to talk to like yeah no so we are for the new uh the new or the old one yeah yeah or you know if I'll sit next to someone from Sprite based on what you kind of just explained I'll be like yeah now this would be like yeah yeah yeah so it's almost like like you know if you if you need traditional risk-free marketing go to Oglevy you know what I mean like don't come near us oh we're in there Tom yeah I was 20 minutes that holy shit we're only halfway through okay interaction so like where do people interact with this I've got to go for it so do they okay cool um okay we might do a two part I mean I guess is a bit of an experiment I understand how long this takes yeah yeah and you can see the value of the conversation and then we're like from that sort of transcript but this is kind of what I feel like this is this is two two hour yeah yeah yeah one two hour works on yeah because you don't rush this shit like this all you went through with that yeah when we come back we'll get like I'll be able to fix that all that and come back and actually have a decent which is probably known as that legial approach right yeah if you do go halfway and then throw some AI into the mix and then see where you land well and the design part like I really want KC to be comfortable with this because it's like I'd rather that he's here yeah like I wouldn't be I wouldn't be happy you guys don't have a text strategy without me here yeah and then it's sort of like the well the design I think I'm what I'm going was this sounds like bullshit or like I this doesn't help me because like the output is that kind of brief as well okay so let's just wrap up the creative brief so the idea to bring our brand to the world was like you know I think it was like the heart knows yeah yeah yeah I like that sorry yeah a little bit sad a lot of things has been and then how the idea works at different layers of your brand world right so how does the heart knows work at the story layer and the culture layer and the interaction layer so at the story layer the heart knows for me that could be like you know um like that could be that um rose through the concrete thought right of beauty and strength like can emerge from surprising places I don't know I'm just trying to wrap it up yeah no it's but it's quite tight now from unlikely places um and then the idea the role of creativity design and technology can play I don't know that's the right question to be honest with you that feels like I just wrote something in that box because our box needed something in it yeah I guess it's kind of like getting to well what is what do we want designed to do what do we want technology to do yeah so what okay what is the role of creativity design and technology like because we were talking before about spec work and making it shareable and sharing our work like personalize mind-blowing like next gen experiences like I read this down when you were talking about before the big wave coming yeah you guys know the Guinness ad the white there's surfer no I'll show it to you in a minute but like I was like I actually want to make that bit of film using surfing footage to talk about AI right like because then the big wave coming you need to paddle into it you're talking about velocity right I want and I don't know that we even need to shoot it I'm sure the footage exists I thought it won't beautiful footage of a surfing or maybe we even use AI a beautiful surfing footage and the voice over or the idea is about AI and it's sort of like so we're just using that analogy right because for me and then we're going from it's about velocity and it's about you know matching the speed and all of those sort of things a technical aspect of surfing but then when you're on well once you're up on the wave it's purely creative like you can go anywhere once you're up on the wave and I just love the idea of like you gotta get fit you like you know you've got to do some what you got to paddle on like don't just sit out the back watching these waves crash on the beach you've got to get on one you've got to have a lot of technical ability to get up on the wave which is like you got to learn how to use AI engines but then once you're up on the wave you can sort of like it's a creative pursuit like I'd love to tell that story and I'd love to show how hard it is with with a bit of film how difficult it is to paddle onto a wave and like until you sort of experience yeah so people understand you've got to fucking you're going to have to swim your ass off and you're probably going to miss a few waves and you're probably going to get dumped then your confidence is going to go low but you've got to keep paddling onto that wave so that it's sort of like because once you get onto the wave and then just opens out onto someone surfing a line that's a nice bit that for me is like the the the the the the eames powers of ten film oh yeah yeah you know the powers of ten like they basically did piece of film for IBM in the 50s right and it was like just it was a shot of two people on a picnic rub and then it zoomed out from the picnic rub by powers of ten and it was like oh we made the camera 10 yeah and then another 10 all the way to outer space it's far into outer space yeah and it came back in and went powers of ten under the skin all the way down to the volicule yeah and what it was talking about was that with computers we can understand more about world and it was for IBM in the 1950s yeah okay so like that what I liked about that idea is like there's so much heart and that idea and that's the role creative is like like you know I'm just gonna go like bring the heart just to wrap it up okay cool do you know rammy",
  "operator_context": {
    "role": "Brand Intelligence Strategist",
    "industry": "Creative Technology", 
    "company_stage": "Launch Phase",
    "years_experience": 10,
    "participant_id": "subfracture-transcript-analysis"
  },
  "target_outcome": "Extract strategic brand insights from this SUBFRACTURE brand development session transcript. Identify breakthrough positioning opportunities, competitive advantages, market gaps, and actionable recommendations for launching this human-centered AI design studio. Focus on the unique value proposition of 'keeping humans in the tech loop' and creating personalized brand worlds.",
  "deep_analysis": true
}